Revit 2026 API

# ReferenceWithContextGetReference Method

---

Gets the reference of the geometric object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReference()
```
```vb
Public Function GetReference As Reference
```
```cpp
public:
Reference^ GetReference()
```
```fsharp
member GetReference : unit -> Reference
```

#### Return Value

Reference The reference of a geometric object when it is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).

#### Reference

ReferenceWithContext Class

Autodesk.Revit.DB Namespace